# Series
ðŸŽ¯A one-dimensional array-like object containing a sequnce of values and associated array of data labels, called its index

In [9]:
import pandas as pd

In [10]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [11]:
# Get the array representation and index object of the Series
obj.values

array([ 4,  7, -5,  3])

In [12]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
# Customize labels - index parameter
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [15]:
# Use labels in the indexing to get the single value or set of values
print(obj2['a'])

-5

In [16]:
print(obj2['d'])

4

In [17]:
print(obj2[['c','a','d']])

c    3
a   -5
d    4
dtype: int64

In [18]:
# Filtering with a boolean array
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [19]:
# Scalar multiplication
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [20]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [21]:
# Mapping of indexing values to data values
'b' in obj2

True

In [22]:
'e' in obj2

False

In [23]:
# Convert Python dicttionary to Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [24]:
obj3 = pd.Series(sdata)

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
# Ovveride the dict keys in the order we want then to appear
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata, index = states)

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
# Missing or NA values detect
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
# Or
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [31]:
# Or
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [32]:
""" A useful Series feature for many applications is that it automatically
aligns by index label in arithmetic operations."""

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [33]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [34]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [35]:
# Both the Series object itself and its index have a name attribute

obj4.name = 'population'

In [36]:
obj4.index.name = 'state'

In [37]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [38]:
obj4.name

'population'

In [39]:
obj4.index.name

'state'

# DataFrame
ðŸŽ¯ðŸŽ¯A DataFrame represents a rectangular table of data and contains an ordered colection of columns, each of which can be a diiferent value type. It has both row and column index

In [40]:
# Construct a DataFrame from a dict of equal-length lists or NumPy arrays (common)
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002,2003],
        'pop': [1.5, 1.7,3.6,2.4,2.9,3.2]
       }

frame = pd.DataFrame(data)

In [41]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
# For learge DataFrames, the head() method selects only the first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [43]:
# We can pass how many rows we want as parameters
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [44]:
# For learge DataFrames, the tail() method selects only the last five rows
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [45]:
# We can pass how many rows we want as parameters
frame.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [46]:
# Manage sequence of columns according to custom order - using columns parameter
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [47]:
# If we pass a column that isn't contained in the dict, it will appear with missing values
frame2 = pd.DataFrame(data, columns = ['year','state','pop','debt'], index = ['one','two','three','four','five','six'])

In [48]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [49]:
# Columns in the DataFrame
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [50]:
# Shape of the DataFrame
frame2.shape

(6, 4)

In [51]:
# Information about the DataFrame
frame2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6 non-null      int64
 1   state   6 non-null      object
 2   pop     6 non-null      float64
 3   debt    0 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 240.0+ bytes

In [52]:
# Statistical summary
frame2.describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [53]:
# Retrieved a column as a series - dict-like notation
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [54]:
# Accessing like object atribute
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [55]:
# Rows can also be retrieved by position or name with the special loc attribute
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [56]:
# Columns can be modified by assignment
frame2['debt'] = 16.5

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [58]:
""" When assigning lists or assarys to a column, the values length must match the length of the DataFrame."""
frame2['debt'] = np.arange(6.)

In [59]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [60]:
# Assign valus to specific rows - using Series
values = pd.Series([-1.2,-1.5,-1.7], index = ['two','four','five'])

In [61]:
# If you assign a Series, its labels will be realigned exactly to the DataFrame's index. Inserting missing values in any holes
frame2['debt'] = values

In [62]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [69]:
# Creatin a new column
frame2['eastern'] = frame2.state == 'Ohio'

In [65]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [70]:
# Delete method can be used to remove column
del frame2['eastern']

In [73]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [75]:
# DataFrame from dict of dicts
pop = {'Nevada':{2001:2.4, 2002:2.9}, 'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [77]:
# If the nested dict is passed to the DataFrame, pandas will interpret the outer dict kes as the columns and the inner keys as the row indices
frame3 = pd.DataFrame(pop)

In [79]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [81]:
# DataFrame can be transposed like NumPy array
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [105]:
pd.DataFrame(pop, index = [2000, 2001, 2002, 2003])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [87]:
frame3.index

Index([2001, 2002, 2000], dtype='int64')

In [90]:
frame3.values
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [101]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [107]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [112]:
# Set the DataFrame name, column name, and index name
frame3.name = 'population'
frame3.index.name = 'yaer'
frame3.columns.name = 'state'

In [114]:
frame3.name

'population'

In [118]:
frame3.index.name

'yaer'

In [120]:
frame3.columns.name

'state'

In [122]:
frame3

state  Nevada  Ohio
yaer
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [124]:
# As with Series, the values attribute returns the data conatined in the DataFrame as a two-dimensional ndarray
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [126]:
# If the DataFrame's columns are different dtypes, the dtype of the values array will be chosen to accommodate all of the the columns
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)